Repository: taha219/SchoolProjectWithCleanArchitecture
Catalog: SchoolProject.Core/Resources/SharedResources.*.resx
Languages: ar

# Addresslength
source: Address must not exceed 50 characters long
ar: يجب أن لا يتعدي طول العنوان عن 50 حرف

# AddressRequired
source: Address Field Is Required
ar: حقل العنوان مطلوب

# DeletedFailedStudent
source: Failed To Delete Student
ar: تعذر مسح الطالب

# DeletedStudent
source: Student Deleted Successfully
ar: تم مسح الطالب بنجاح

# DepartmentIsNotExist
source: This Department Not Exist
ar: هذا القسم غير موجود

# EditStudent
source: Student Edited Successfully
ar: تم تعديل الطالب بنجاح

# EditStudentDepartment
source: Student Department Successfully
ar: تم تعديل قسم الطالب بنجاح

# EmailNotVaild
source: Email Format Is Not Valid
ar: صيغة الايميل غير صحيحة

# EmailRequired
source: Email Field Required
ar: حقل الايميل مطلوب

# GetDepartmentByID
source: Department Retrieved Successfully
ar: تم إرجاع القسم بنجاح

# GetStudent
source: Student Retrieved Successfully
ar: تم إرجاع الطالب بنجاح

# GetStudentList
source: Students Retrieved Successfully
ar: تم إرجاع الطلاب بنجاح

# Namelength
source: Name must not exceed 20characters long
ar: يجب أن لايزيد الاسم عن 20 حرف

# NameRequired
source: Name Field Is Required
ar: حقل الاسم مطلوب

# NotFoundDepartment
source: Department Not Found
ar: هذا القسم غير موجود

# NotFoundStudent
source: Student is not found
ar: الطالب غير موجود

# PasswordNotValid
source: Password must be 6-50 characters and include uppercase, lowercase, number, and special character.
ar: يجب أن تتكون كلمة المرور من 6 إلى 50 حرفًا وتتضمن أحرفًا كبيرة وصغيرة وأرقامًا وحرفًا خاصًا.

# PasswordRequired
source: Password Field Is Required
ar: حقل كلمة السر مطلوب

# PhoneRequired
source: Phone Number Field Is required
ar: حقل رقم الموبايل مطلوب

# PhoneNotVaild
source: Phone must be a 11 digit & egyptian number
ar: يجب أن يكون الرقم مصري ويتكون من 11 خانة

# UserWithExistUserNameFound
source: There is User With Same UserName
ar: هناك مستخدم بنفس الاسم

# UserWithExistEmailFound
source: There Is User With Same Email
ar: هناك مستخدم بنفس الايميل

# AddUserSuccessfully
source: User Added Successfully
ar: تم إضافة المستخدم بنجاح

# AddUserFailed
source: Failed to create user
ar: فشل إنشاء المستخدم

# UserNotFound
source: This User is Not found
ar: هذا المستخدم غير موجود

# GetSingleUserByUserName
source: User Retrieved Successfully
ar: تم إرجاع المستخدم بنجاح

source: Edit user Successfully
ar: تم تعديل المستخدم بنجاح

source: Edit user failed
ar: لم يتم تعديل المستخدم

# DeletedUser
source: User Deleted Successfully
ar: تم مسح المستخدم بنجاح

# DeleteUserFailed
source: Failed To Delete User
ar: تعذر مسح المستخدم

source: Password Changed Successfully
ar: تم تغيير كلمة المرور بنجاح

# NewPassNotEqualConfirmPass
source: New Password is not qual confirm password
ar: كلمة المرور الجديدة لا تساوي كلمة المرور المؤكدة

# OldPasswordIncorrect
source: Old Password Is Incorrect
ar: كلمة المرور القديمة غير صحيحة
